Расчетный счет: 1280190001449890 (Сом) Банк: ЗАО "Кыргызский инвестиционно кредитный банк", БИК: 128019 <br>
Юридический адрес: г.Бишкек, ул. Матросова, д. 102
 <br>
 <br>
 <br>
 <br>
Банк: «Universalbank» АТБ Тошкент БХМ, МФО: 00973 (МФО для контрактов: 11852), ИНН: 203 556 638, ОКЭД: 64 190, Расчетный счет в UZS: 2020 8000 9007 6800 5001, Расчетный счет в USD Доллар: 2020 8840 1007 6800 5001, Расчетный счет в EUR: 2020 8970 5007 6800 5001, СВИФТ: PJUNUZ22<br>
Юридический адрес: г. Ташкент, Мирабадский район, ул. Амира Темура, дом 53
 <br>
 <br>
