<p>
    Учебный центр Dental Korzina - это практикующие лекторы высокого уровня, просторные учебные классы, профессиональное оборудование, зоны отдыха и пространства для проведения кофе-брейков и обедов.
</p>
<p>
    Наши учебные классы оснащены современными персональными компьютерами, техноскопами Carl Zeiss, фантомами Frasaco, артикуля- торами с лицевыми дугами Amann Girrbach, микромоторами Marathon, наконечниками, пустерами, полиме- ризационными лампами и всем необходимым для того, чтобы студенты могли закрепить полученные теоретические знания на практике.
</p>